Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum
The enum for the type of property from PSet

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.LengthMeasure
millimeters (mm)

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.AreaMeasure
square meter (m2)

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.VolumeMeasure
cubic meter (m3)

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.MassMeasure
kilograms (kg)

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.AngleMeasure
degrees

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.String
The string value, can be used for text or enum values

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.Number
The number value, can be used for decimal or double values

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.Boolean
Boolean value, can be FALSE or TRUE

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.Array
The array of values, can be used for enum or string values

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.Integer
The integer value, can be used for enum values

Tekla.Structures.ModelInternal.PropertyDefinitionTypeEnum.NoType
The type is not defined, used for PropertySetDefinition without type